Table of Contents
 Class MatPrestressSteelEc2
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material prestressing steel Ec2
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatPrestressSteelECEN,CI.Material", "CI.StructModel.Libraries.Material.IMatPrestressSteel,CI.BasicTypes", typeof(MatPrestressSteel))]
public class MatPrestressSteelEc2 : MatPrestressSteel
Inheritance
object
OpenObject
OpenElementId
Material
MatPrestressSteel
MatPrestressSteelEc2
Inherited Members
 MatPrestressSteel.Diameter
 MatPrestressSteel.Area
 MatPrestressSteel.NumberOfWires
 MatPrestressSteel.EquivalentDiameter
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 MatPrestressSteelEc2()
Constructor
public MatPrestressSteelEc2()
Properties
 Agt
Total elongation at max. force (prEN 10138)
public double Agt { get; set; }
Property Value
double
 DiagramType
Type of diagram
public ReinfDiagramType DiagramType { get; set; }
Property Value
ReinfDiagramType
 Epsuk
Characteristic strain at maximum load (EN 1992-1-1)
public double Epsuk { get; set; }
Property Value
double
 Fm
Char. value of max. force (prEN 10138)
public double Fm { get; set; }
Property Value
double
 Fp01
Char. 0.1% proof force
public double Fp01 { get; set; }
Property Value
double
 Fp01k
0,1% proof-stress (EN 1992-1-1)
public double Fp01k { get; set; }
Property Value
double
 Fpk
Characteristic tensile strength (EN 1992-1-1)
public double Fpk { get; set; }
Property Value
double
 Fr
Fatigue stress range (prEN 10138)
public double Fr { get; set; }
Property Value
double
 Production
Production type
public ProductionType Production { get; set; }
Property Value
ProductionType
 SurfaceCharacteristic
Surface characteristic
public SurfaceCharacteristicType SurfaceCharacteristic { get; set; }
Property Value
SurfaceCharacteristicType
 Type
Type of prestress steel
public PrestressSteelType Type { get; set; }
Property Value
PrestressSteelType
 Edit this page